[
  {
    "name": "Amanda Sabal",
    "organization": "Asian Student Achievement - Not-for-Profit",
    "position": "Director of Operations",
    "bio": "Amanda Sabal has been in the IT industry for over 10 years and has worked for top companies such as IBM, Allstate, and Walgreens. Alongside building her career, Amanda believes in giving back through volunteering with various organizations.  Her early roots of volunteering are with ALPFA and ProHispanica (formerly NSHMBA), both a member based organization with a mission to build professional  leaders in the community. This has laid the foundation of where Amanda's leadership skills where built and strengthen through various projects.\n\nA recent project Amanda has curated and facilitated which received high recognition  titled 'Uncovering the surge of racism and crime in the Asian community'. This discussion has taken place during the Covid-19 pandemic highlighting the impacts of the blame of the covid-19 virus on the Asian community from government to ground zero.",
    "image": "Amanda-Sabal.png"
  },
  {
    "name": "Anakbayan Chicago",
    "organization": null,
    "position": "Community Organizer",
    "bio": "Anakbayan Chicago is a Filipino youth and student organization fighting for genuine liberation and democracy in the Philippines.",
    "image": "Anakbayan-Chicago.png"
  },
  {
    "name": "Chicago Committee for Human Rights in the Philippines (CCHRP)",
    "organization": null,
    "position": "Education Officer",
    "bio": "CCHRP (Chicago Committee for Human Rights in the Philippines) is an organization that promotes, defends, and advocates for human rights in the Philippines. It was launched in 2018 and has been supporting the Lumad struggles since its inception. CCHRP stands in solidarity with people's struggles in Chicago and worldwide.",
    "image": "CCHRP.png"
  },
  {
    "name": "Christina (Tina) Horton (she/her)",
    "organization": "UIUC and Intuit: The Center for Intuitive and Outsider Art",
    "position": "Development Associate",
    "bio": "Tina Horton received a Bachelor's in Music Education from the University of Florida in 2015 and a Master of Music in Musicology from the University of Illinois (UIUC) in 2019. Her research specialized in traditional music practices (gamelan) from Indonesia and their presence in US colleges and universities. When she began her doctoral studies at UIUC in 2020, she turned her attention to a vocal music tradition (pabasa ng pasyon) practiced by certain Filipino American communities'a tradition she learned about from her own grandmother.",
    "image": "Tina-Horton.png"
  },
  {
    "name": "Dr. David Chih",
    "organization": "University of Illinois at Urbana-Champaign",
    "position": "Director - Asian American Cultural Center",
    "bio": "Dr. David Chih is the founding director of the UIUC Asian American Cultural Center which opened in 2005. For over 30 years, he has focused on issues of diversity and inclusion in higher education with particular emphasis on Asian American and international student communities. Since coming to UIUC in 1998, he has served as assistant dean of students for Asian Pacific American Affairs and as clinical counselor in the Counseling Center. More recently, he served as interim associate vice chancellor for student affairs and director of the Office of Inclusion and Intercultural Relations which is comprised of UIUC's eight cultural/resource centers. He teaches a global studies AACC internship course and an Asian Families in America course. He received a PhD in counseling psychology and a BA in East Asian studies and psychology from Indiana University, an MS in psychology from Purdue University, and completed a doctoral internship in psychology at Michigan State University Counseling Center. David is a second-generation Chinese American born and raised in Bloomington, Indiana.",
    "image": "David-Chih.png"
  },
  {
    "name": "I-Cause",
    "organization": "University of Illinois at Urbana-Champaign",
    "position": "Registered Student Organization",
    "bio": "Illinois Coalition Assisting Undocumented Students' Education (I-CAUSE) is a registered student organization at the University of Illinois at Urbana-Champaign. As I-CAUSE we seek to create an alliance for undocumented students on campus that prioritizes creating equal educational opportunities for students regardless of status. We educate the community at large. We advocate and organize for resources and legislation that aids undocumented students within their postsecondary education. I-CAUSE also provides scholarships and mentorship to undocumented students on campus. I-CAUSE hopes to make higher education more accessible for all students regardless of immigration status.",
    "image": "I-Cause.png"
  },
  {
    "name": "JR Kuo",
    "organization": "CoffeeWithJR",
    "position": "Owner and Speaker",
    "bio": "JR Kuo is a firm believer that everyone holds an infinite amount of space within, calling us to express our truest selves. Everyone matters! He wants to invite everyone to experience the wonder of what it means to be at ease and free to create the life you crave.\n\nJR is a national speaker, trainer, and coach. He is also the founder of CoffeeWithJR (coffeewithjr.com), a company that specializes in providing culturally competent mental health and diversity/inclusion trainings. JR has over 10 years of experience in professional speaking. He has trained college students and professionals on mental health at over 50 universities and dozens of organizations across the country. JR is also an instructor for Mental Health First Aid. As a diversity/inclusion trainer, JR has facilitated numerous DEI workshops for Fortune 500 companies, as well as locally for companies in Denver, Colorado. He also teaches at the University of Colorado at Boulder and Denver on leadership, cultural competency, and mental health. In addition to being a professional speaker, JR has 10 years of experience managing and running nonprofit organizations and small businesses.\n\nAs an immigrant who has struggled with the immigration system, JR is passionate about advocating for immigration reform and supporting immigrants in the United States. JR's mental health journey as an immigrant is featured in a short documentary called 'Coffee Talking Out of Mental Coffins,' and in the Harvard Kennedy School's Asian American Policy Review.\n\nTo learn more about JR Kuo's life story and achievements and watch 'Coffee Talking Out of Mental Coffins,' please visit www.coffeewithjr.com/meet-jr",
    "image": "JR-Kuo.png"
  },
  {
    "name": "Judy Robinson",
    "organization": null,
    "position": "Author of 1521: Re-Discovering the History of the Philippines",
    "bio": "Judy Robinson was born and raised in the Philippines and now lives in the Washington DC area. She graduated with a Bachelor's Degree from the University of the Philippines Diliman and a Masters Degree in Business Administration from Georgetown University. \n\nShe does not consider herself a historian. Judy is more comfortable around spreadsheets and analyzing the story behind data. Innate curiosity and love for life long learning instilled by her parents and grandparents led to writing this book. \n\nIn remembering the 500-year anniversary of Magellan's arrival in the Philippines, Judy decided to revisit the story of this extraordinary voyage. She realized there were stories from Philippine history that she wanted to share with her nephews and nieces. This grew into a book for the Filipino diaspora, especially the next generation.",
    "image": "Judy-Robinson.png"
  },
  {
    "name": "Kareem Hepburn",
    "organization": null,
    "position": null,
    "bio": "Kareem Hepburn is a programmer that started his career back in 2008. After immigrating to the United States to study nursing, he has committed to his passions and found his path in a career he loves. Kareem has always had a passion for creating, whether it be writing his novel or STEM. He found his niche in programming from his innate curiosity to solve puzzles. He is currently working for multiple companies that differ in industry. Kareem works in finance, real estate, HR, but he is most excited about his project involving LIDAR. He is a firm believer that, if your passion and commitment is strong enough, it's always best to do what you really love doing since contentment isn't something you should compromise on.",
    "image": "Kareem-Hepburn.png"
  },
  {
    "name": "Kevin Moreno (he/him)",
    "organization": "Spaulding Ridge",
    "position": "Software Consultant",
    "bio": "Kevin is a graduate of The Ohio State University where he specialized in Accounting and Entrepreneurship and was a member of Alpha Kappa Psi Professional Business Fraternity. He began his career with Ernst & Young where he became a licensed Certified Public Accountant (CPA) and focused on engagements related to technology/cybersecurity for his clients within the financial services sector. Kevin is currently at Spaulding Ridge where he has shifted his focus on implementing enterprise cloud software across various industries. Outside of his career, Kevin is a current Board Member of the PUSO Foundation, enjoys attending music festivals, travel, photography, and is a resident of the Washington D.C. Metro area.",
    "image": "Kevin-Moreno.png"
  },
  {
    "name": "Lakhi Siap (he/him)",
    "organization": "Chicago Asian Network",
    "position": "Founder",
    "bio": "Lakhi Mangharam Siap was born and raised in Cebu City Philippines to an Indian mother and a Filipino-Chinese father. Being raised with multiple cultures in his home was never a boring moment in his upbringing. He graduated at Philippine High School for the Arts on a 4-year theater scholarship. He immigrated to Chicago in 2006 and pursued a degree in nursing while at the same time immersing himself and being heavily involved with the Asian American community.  He began volunteering and taking on leadership positions for various non-for-profit organizations. He saw a lack of representation and collaboration within the Asian American community that in 2010 He founded the Chicago Asian Network (CAN), a community focused full service multicultural marketing firm with the mission of connecting and creating dialogue amongst Asian American organizations, programs and institutions and serving as a liaison to corporations and businesses that wish to effectively engage with Asian American leaders, organizations and the community. He is passionate about the need for Filipino American leadership and representation and serves on the board of the Filipino Young Leaders Program (FYLPRO) and is a founding member of Unipro Chicago.",
    "image": "Lakhi-Siap.png"
  },
  {
    "name": "Louella Rose Cabalona (she/hers/siya)",
    "organization": "Health Care Services Corporation (Blue Cross Blue Shield of Illinois)",
    "position": "Sr. Platform Business Product Consultant",
    "bio": "Louella Rose Cabalona is an IT Professional with over 20 years of experience specializing in Data Warehousing, Business Intelligence and Big Data for various Fortune 500 companies. She is a Sr. Manager of Business Management Platforms for Data and Analytics Solutions at Blue Cross Blue Shield Illinois (HCSC). As Product Owner of the DI Platform, she leads in building the frameworks, processes and best practices for adoption of data integration tools such as Talend, Erwin and DataStage across the enterprise. She also manages the modernization and hardening of the Data Lake.\n\nLouella is also an accomplished actress who has been in many television shows, commercials, and stage productions performing across Asia; and is the Lead Singer, Producer and Creative Director for Filipino Folk fusion band SamaSama Project.\n\nHer multiple careers, including being a writer for Chicago-based Via Times NewsMagazine, intersect at understanding truths through stories founded in data and facts. She claims she fell in love with IT when she realized the power of SQL in telling stories.\n\nAs President for the nonprofit Filipino Young Leaders Program (FYLPRO), Louella leans on her expertise to develop standardized operations, data collection and organizational documentation that help achieve the nonprofit's strategic goals for sustainability. She also serves as Director for Asian Popup Cinema, the Philippine American Chamber of Commerce of Greater Chicago (PACCGC), and the Midwest Pilipino American Coalition (MPAC).\nOf the many hats she wears, however, she finds being mama to her toddler Reign and life-long partner to husband Baron, most fulfilling.",
    "image": "Louella-Rose-Cabalona.png"
  },
  {
    "name": "Maria Climaco Van Gundy (she/her)",
    "organization": "University of Illinois College of Medicine",
    "position": "Medical Student",
    "bio": "Maria Climaco Van Gundy is a 3rd year medical student in the Rural Medicine Program at the University of Illinois College of Medicine. She is passionate about building relationships with patients and providing longitudinal care. She graduated from UIUC with a major in Community Health and minor in Chemistry. She is a proud alumni of PSA UIUC where she served as the Co-Cultural Chair, Vice President External and FACT 2017 Co-Coordinator.",
    "image": "Maria-Climaco-Van-Gundy.png"
  },
  {
    "name": "Marianne Reyes (she/her/hers)",
    "organization": "NorthShore University HealthSystem - Highland Park",
    "position": "Staff Nurse",
    "bio": "Marianne Reyes earned her Bachelor of Science in Nursing (BSN) degree from the University of Illinois at Chicago (UIC) in May 2021. Although her diploma is from UIC, she is very fortunate & grateful to have been able to call UIUC her home for the past 6 years. Marianne was Co-Awareness, Secretary, FACT's Campus Ambassador, and Filipino Culture Night Dinner Co-Coordinator for PSA UIUC. She is currently a med-surg telemetry nurse in Highland Park. Prior to this job, she worked in Chicago as a behavioral health nurse for adolescents and children. She is eager to share her wisdom & life experiences and encourage aspiring healthcare workers.",
    "image": "Marianne-Reyes.png"
  },
  {
    "name": "Marielle Gamo (she/her/hers)",
    "organization": "UnityPoint Health",
    "position": "Behavioral Health Clinician and/or Mental Health Therapist",
    "bio": "Marielle Gamo is a proud graduate of UIUC and an alumna of UIUC's Philippine Student Association (PSA). Throughout Marielle's time in PSA, she served as Vice President Internal (VPI) in 2017-2018 and had the opportunity to be in charge of the family system/AKA (Ate, Kuya, Ading) system. During undergrad, Marielle studied sociology and then immediately afterward, pursued her master's in social work from Loyola University Chicago. Marielle has had experience working with individuals with intellectual and developmental disabilities, as well as working on inpatient psychiatric units with adult and geriatric populations. Marielle currently works as a Behavioral Health Clinician/Mental Health Therapist at UnityPoint Health Methodist Hospital, located in Peoria, IL, working with adults ages 18-64. Marielle works with a variety of patients diagnosed with several different mental disorders who are experiencing a crisis. Marielle, just like many of us, grew up without conversations surrounding mental health. Therefore, Marielle pursued a career in social work to help those struggling with mental health issues who do not have direct access to mental health resources. Marielle wants to change the narrative and stigma associated with mental health to showcase the importance of what making yourself a priority truly means. \nScreen reader support enabled.",
    "image": "Marielle-Gamo.png"
  },
  {
    "name": "Melorie Serrano Masacupan (she/her/hers/siya)",
    "organization": "The Teaching Well",
    "position": "Marketing Manager & Mindfulness Mentor",
    "bio": "Marketing manager by day and social entrepreneur by night, Melorie Serrano Masacupan is a multidisciplinary artist with over a decade of experience in decolonizing education and organizational wellness. She gets free through writing, singing, and somatic practices informed by yoga, reiki, and massage from her ancestral lineage of Philippine manghihilot.\n\nMelorie facilitates a racial healing group for AAPI educators, guides movement and meditation for survivors of sexual violence, coaches unpublished authors overcoming procrastination, and runs a small digital agency uplifting BIPOC brands-- so holla if you're interested in commission work for graphic design, web dev, or photo/videography!",
    "image": "Melorie-Serrano-Masacupan.png"
  },
  {
    "name": "Michelle Macrohon (she/her/hers)",
    "organization": "Subtle Filipino Traits",
    "position": "DJ & Founder of Subtle Filipino Traits",
    "bio": "Michelle Macrohon from Fontana, CA founded Facebook group Subtle Filipino Traits in 2019. A lover of culture, Subtle Filipino Traits was created to connect the greater community and to allow others to share what being Filipino means to them globally. 117K members later, the SFT Teams strives to continue fostering a place where kababayan can celebrate their Filipino identity, whether they're in the homeland or abroad. Nowadays, she is a DJ who goes by the name of SEDUZA. She plays all over Southern California and has opened for artists like Laidback Luke and Albert Posis (both Filipino artists) and hopefully internationally one day.",
    "image": "Michelle-Macrohon.png"
  },
  {
    "name": "Midwest Association of Filipino Americans",
    "organization": null,
    "position": null,
    "bio": "Established at FACT about 11 years ago, the Midwest Association of Filipino Americans works towards promoting Filipino/-American and Asian/-American issues, providing professional networking opportunities for its members as well as to cultivate and forward the Midwest Filipino-American identity in order to unify 24 schools and counting in the greater Midwest Region.",
    "image": "MAFA.png"
  },
  {
    "name": "Racquel \"Rae\" Ebue (she/her/hers)",
    "organization": "HD Biosciences, BadAss Do-Gooders, Pulse Kinection",
    "position": "Research Associate, Co-Founding Member, Founder",
    "bio": "Rae Ebue (Eb-way) is a dancer, community organizer, and scientist on a mission to ignite growth mentality through re-education of self-conscious action, awareness of Filipinx-Americans in hip hop, and freedom of movement expression. As the Founder of Pulse Kinection and Co-founding member of BadAss Do-Gooders, Rae creates events and community programs that bridge the gap between visual performing arts and social change. When Rae is not engaged with community work, she works full time as a Research Scientist, enjoys spending time outside, travelling, or attending music festivals.",
    "image": "Racquel-Rae-Ebue.png"
  },
  {
    "name": "Ryne Dionisio",
    "organization": "UniPro",
    "position": "Pilipino American Unity for Progress Director",
    "bio": "Ryne Dionisio is a senior software engineer living in Chicago who graduated from the University of Illinois at Urbana-Champaign. While there he was heavily involved with the Philippine Student Association, serving as co-head coordinator of the Filipino Americans Coming Together (FACT) conference in 2003 and president of the organization. After graduating he created and organized the Conference Within a Conference workshop at FACT 2006, the first gathering of Filipino-American student leaders that would eventually lead to the creation of the Midwest Association of Filipino Americans (MAFA) organization. He became the Special Projects Contributor for the Filipino-American lifestyle website BakitWhy.com in 2008, forming the Chicago team and writing articles covering events in the area and hosting the short-lived BakitWhy podcast. Ryne co-founded and became the first president of the Chicago chapter of Pilipino American Unity for Progress (UniPro) in 2015, a national nonprofit dedicated to educating, empowering, and connecting the Pilipino American community. He currently serves on the Board of Directors for UniPro.",
    "image": "Ryne-Dionisio.png"
  },
  {
    "name": "Sam Ogdoc (he/his/him)",
    "organization": "Torrent Consulting",
    "position": "Solution Engineer - Healthcare & Life Sciences",
    "bio": "Torrent Consulting is a Salesforce Implementation Partner focused on mid-commercial sized businesses. As a Solution Engineer for Healthcare & Life Sciences, it is my responsibility to meet with prospective clients & existing customers that are looking to initially procure Salesforce or enhance their existing Salesforce instance and define what they are looking to achieve. I work closely with our Sales teams & Delivery directors to define Scopes of Work, Resource Allocation Plans, and help design/build repeatable solutions for common healthcare use cases we identify in the market.",
    "image": "Sam-Ogdoc.png"
  },
  {
    "name": "Shane Carlin",
    "organization": "Asian Student Achievement - Not-for-Profit",
    "position": "President/CEO",
    "bio": "Shane Carlin's professional career has been in fundraising and Student Affairs where he was the Director of Development for Student Life and Scholarships at Northwestern University, Assistant Vice Chancellor for Student Affairs Advancement at the University of Illinois at Urbana-Champaign. Carlin has also worked as the Director of Corporate and Foundation Relations at the National Association of Student Personnel Administrators (NASPA), as well as in Residence Life and Housing at Miami, Northwestern, and Capital Universities.\n\nHe is a Korean American adoptee where he grew-up in northern Kentucky. Carlin earned his Bachelor of Science in Agricultural Communications from the University of Kentucky and his Master of Science in College Student Personnel from Miami University. \n\n?Carlin not only has over 20 years of experience in higher education administration, but also has mentored students in international settings. Besides his expertise in higher education, Carlin is an experienced public speaker. He has been invited to speak at universities from coast to coast. In addition, he was a speaker for TEDx Lakeshore East in 2011. Internationally, Carlin presented the 'Western Way of Networking' to students at Hong Kong University Science & Technology (HKUST) and managers at General Electric (GE) in Shanghai at the China Technology Center.",
    "image": "Shane-Carlin.png"
  },
  {
    "name": "UniPro Chicago",
    "organization": null,
    "position": "501c3 non-profit organization",
    "bio": "Unipro Chicago is a 501c3 non-profit organization seeking to empower and unify the Pilipino/a/x-American Chicago community through education, allyship, and Kapwa to catalyze transformative change.",
    "image": "UniPro-Chicago.png"
  }
]
